[
    {
        "image": "/images/work/rga.svg",
        "role": "Senior Experience Designer",
        "company": "R/GA",
        "type": "Contract",
        "start": "Aug 2020",
        "end": "Nov 2020",
        "location": "Singapore (Remote)",
        "description": "I helped out the R/GA team with a couple of international projects."
    },
    {
        "image": "/images/work/spaceship.svg",
        "role": "Head of Product and Design",
        "company": "Spaceship AU",
        "type": "Full-time",
        "start": "Dec 2016",
        "end": "Sep 2017",
        "location": "Sydney, Australia",
        "description": "Spaceship is an entirely new type of superannuation fund that lets you invest your super in the future. My focus involved building the front-end development and design teams, defining the new Spaceship style guide, crafting scalable interfaces and thinking about the future of how we interact with our personal finances."
    },
    {
        "image": "/images/work/tyro.png",
        "role": "Visual Designer",
        "company": "Tyro Payments",
        "type": "Freelance",
        "start": "Jul 2016",
        "end": "Nov 2016",
        "location": "Sydney, Australia",
        "description": "I worked with Tyro’s marketing team for a little while to lead a new campaign for the digital marketing team, launch new product landing pages and produce rich marketing collateral including email templates and e-books."
    },
    {
        "image": "/images/work/uts.svg",
        "role": "Technical Consultant",
        "company": "University of Technology Sydney",
        "type": "Contract",
        "start": "Jun 2016",
        "end": "Aug 2016",
        "location": "Sydney, Australia",
        "description": "I was hired by my university’s Innovation & Creative Intelligence Unit to create a platform that allows motivated, entrepreneurial students to find other talented students, form groups and work together on launching startups."
    },
    {
        "image": "/images/work/palantir.svg",
        "role": "Product Designer",
        "company": "Palantir Technologies",
        "type": "Internship",
        "start": "Oct 2015",
        "end": "Dec 2015",
        "location": "Palo Alto, California",
        "description": "I spent three months working at the Palantir Headquarters in Palo Alto, California. I was on an amazing team tasked with designing an anti-fraud focused pilot project. Palantir was my first purely design-focused role at a company and it was an incredible experience with valuable lessons in UI & UX design, ideation, prototyping and collaboration on a large-scale project."
    },
    {
        "image": "/images/work/sumry.svg",
        "role": "Head of Product",
        "company": "Sumry",
        "type": "Full-time",
        "start": "Aug 2014",
        "end": "Jul 2015",
        "location": "Sydney, Australia",
        "description": "While working as Head of Product at Sumry, I designed and implemented an entirely new user interface and platform from ground up, built on Angular. I also spent a lot of time refining the logo, colour palette, social media and overall brand identity. The result was a platform that replaces your resume with an interactive timeline and helps employers understand the real you."
    },
    {
        "image": "/images/work/gunmetal.svg",
        "role": "Co-Founder",
        "company": "Gunmetal Studio",
        "type": "Self-employed",
        "start": "Jun 2014",
        "end": "May 2015",
        "location": "Sydney, Australia",
        "description": "While I was in university, I co-founded Gunmetal - an independent web design and development studio. During this time, we had the privilege of working with a range of clients from startups to clothing brands and even big corporate and entertainment companies. Some of our clients included Vimbra, Trekalo, Ryzer, Wild Animal Encounters and National Geographic Channel."
    },
    {
        "image": "/images/work/mindarc.svg",
        "role": "Automation Engineer",
        "company": "MindArc Digital Agency",
        "type": "Contract",
        "start": "Nov 2014",
        "end": "Apr 2015",
        "location": "Sydney, Australia",
        "description": "I worked at MindArc as an automation engineer and Magento developer for a short while. I was primarily tasked with rebuilding Magento themes from ground up and creating helpful scripts, however I also worked on some of the client sites. Some of these include famous e-commerce sites like Hello Molly and ShowPo. I also redesigned the MindArc homepage from the ground up."
    },
    {
        "image": "/images/work/zookal.svg",
        "role": "Web Developer",
        "company": "Zookal",
        "type": "Full-time",
        "start": "Apr 2013",
        "end": "May 2014",
        "location": "Sydney, Australia",
        "description": "During the first few years of my university degree, I was the lead web developer at Zookal. I worked directly with the CTO on building the new Zookal homepage, focusing on modern design and strong responsive capability for an e-commerce site. I also had the chance to work on Zookal’s content-sharing app before it became a big deal in Asia."
    }
]